import file2 as app2

print(app2.name)

app2.printhallo()

# Pyhton Modules  -  وحدات بايثون
# -----------------------------------
# ستتعلم اثناء هذا الدرس كيفية ربط
#  ملفات بايثون ببعضهم 
#  او بالاختصار كيفية استرداد
#  اوامر بايثون من ملف بايثون اخر
# -----------------------------------
# import -  استيراد
# -----------------------------------
# الأمر إمبورت يتم استخدامها لاسترداد 
# اوامر بايثون من ملف بايثون اخر 
# او لأسترداد اوامر من مكاتب بايثون 
# الجاهزة لأستخدام تلك اوامر في 
# ملف بايثون خاص بك عندما ترغب بذلك