# Python File Open - طريقة فتح ملف بواسطة بايثون او قرائته
# ================================================================ 
# open("","r") يستخدم لفتح ملف حرف ار يعني فتح ملف بحالة قراءة
# ================================================================ 
#  read() يستخدم لقراءة كامل محتوى الملف
# ================================================================ 
# read(2) بدل العدد 2 يمكنك وضع بنفس طول احرف الذي ترغب بقرائته
# readline() يمكنك استخدامها لقراءة سطر من بيانات 
# close() يستخدم لاغلاق الملف المفتوح
# ================================================================ 
# mode . لمعرفة باي حالة تم فتح الملف المحدد 
# closed لتحقق من ان كان ملف تم اغلاقه او لا
# name  لجلب اسم الملف

file = open("files/text.txt","r")
print(file.readline())
print(file.readline())
file.close()
print(file.name)
# print(file.read(40))



 