from file2 import name
from file2 import printhallo
import file2

print(file2.name)
printhallo()

print(name)

# -----------------------------------
# from - من
# -----------------------------------
# import - استيراد
# -----------------------------------














# Pyhton Modules  -  وحدات بايثون
# -----------------------------------
# ستتعلم اثناء هذا الدرس كيفية ربط
#  ملفات بايثون ببعضهم 
#  او بالاختصار كيفية استرداد
#  اوامر بايثون من ملف بايثون اخر
# -----------------------------------
# import -  استيراد
# -----------------------------------
# الأمر إمبورت يتم استخدامها لاسترداد 
# اوامر بايثون من ملف بايثون اخر 
# او لأسترداد اوامر من مكاتب بايثون 
# الجاهزة لأستخدام تلك اوامر في 
# ملف بايثون خاص بك عندما ترغب بذلك