# Python File Write - كيفية كتابة او تعديل على ملفات في بايثون
# =========================================================================================================
# حرف ا يستخدم لإضافة مزيد من محتوى الى نهاية قيمةالذي يملكه الملف المحدد
# "a" - Append - will append to the end of the file
# =========================================================================================================
# يستخدم لوضع قيمة الذي تحدده بدل القيمة الذي يملكه الملف المحدد
# "w" - Write - will overwrite any existing content

# will create a file if the specified file does not exist - سيُنشئ ملفًا إذا كان الملف المحدد غير موجود
# =========================================================================================================
# حرف اكس اذا استخدمته سيتم إنشاء ملف ، وإرجاع خطأ إذا كان الملف موجودًا 
# "x" - Create - will create a file, returns an error if the file exist   
   
# will create a file if the specified file does not exist - سيُنشئ ملفًا إذا كان الملف المحدد غير موجود
# # =========================================================================================================
# write() يستخدم لانشاء او تعديل على ملف المحدد

# file = open("text.txt","a")
# text = input("قم بكتابة النص الذي ترغب بإضافته في النهاية ")
# file.write(text)
# file.close()

file = open("text2.txt","x")
file.write("Coder Shiyar Python")
file.close()

