text = "Python" + " in Arabic"  + " With Coder Shiyar "
text += " On YouTube"
print(text)
# Python Arithmetic Operators   -  معاملات بايثون الحسابية
# ----------------------------------------------------------------------------------------------------
# Operator	    Name                                ترجمة
# +	            Addition	                   جمع
# -	            Subtraction	                    طرح
# *	            Multiplication                  ضرب
# /	            Division                        قسمة
# %	            Modulus                         يقوم بإعادة لك الباقي
# **	            Exponentiation                  الأس
# //	            Floor division                 تقريب النتيجة إلى أقرب عدد صحيح
# ----------------------------------------------------------------------------------------------------
# Python Assignment Operators   -   عوامل التعيين في بايثون
# ----------------------------------------------------------------------------------------------------
# =
# +=	
# -=	
# *=	
# /=
# %=		
# //=	
# **=	
