name = "Shiyar"
languages = {"js","html","css"}
result = "js"  in languages and "java" not in  languages and name == "shiyar"
print(result)

# age = 21
print(not(20<10))
# print(name == "Shiyar" and age!=20 and  (age<18 or age>30 or age==21)   )



# Python Logical Operators
# ------------------------------------------------------------------------------------
# Operator	ترجمة	
# ------------------------------------------------------------------------------------
# and 	        و	       
# or	        او	
# not	        عكس نتيجة - Reverse the result, returns False if the result is true	
# ------------------------------------------------------------------------------------
# Python Membership Operators
# ------------------------------------------------------------------------------------
# Operator	                                                                    معنى	
# ------------------------------------------------------------------------------------
# in 		                                                               موجود  في 
#                : يقوم بإعادة صح إن كانت القيمة محددة موجودة في متغير الذي تحددها
# not in                                                                 غير موجود  في 
#            : يقوم بإعادة صح إن كانت القيمة محددة غير موجودة في متغير الذي تحددها



# Python Comparison Operators
# -----------------------------------------------------------------
# Operator	        Name                                ترجمة
# ---------------------------------------------------------------	
#    ==	            Equal	                               يساوي
#    !=	            Not equal	                        لا يتساوى
#    >	            Greater than	                     اكبر  من
#    <	            Less than	                          اصغر من
#    >=	            Greater than or equal to    اكبر من او يساوي	
#    <=	            Less than or equal to	    اصغر من او يساوي


# Python Identity Operators
# -----------------------------------------------------------------
# Operator	        Description             ترجمة
# ---------------------------------------------------------------	                                      
# is 	                Equal	             يكون | يساوي
# is not	            Not equal           لا يكون | لا يتساوى